#include "users.h"

user users[21] = {
    // Администратор
    {1, "ivanov", "Иванов И.И.", "1", "Администратор", ""},
    // Диспетчеры
    {2, "petrov", "Петров А.Р.", "2", "Диспетчер", "Геймдизайнеры"},
    {3, "ignatov", "Игнатов Д.Н.", "3", "Диспетчер", "Художники"},
    {4, "dahov", "Дахов С.В.", "4", "Диспетчер", "Программисты"},
    {5, "mil", "Миль Д.К.", "5", "Диспетчер", "Тестировщики"},
    // Рабочие
    // геймдизайнеры
    {6, "bobrov", "Бобров Б.И,", "6", "Рабочий", "Геймдизайнеры"},
    {7, "kurochkin", "Курочкин А.А.", "7", "Рабочий", "Геймдизайнеры"},
    {8, "popova", "Попова А.Н.", "8", "Рабочий", "Геймдизайнеры"},
    {9, "vasilev", "Васильев Н.Н.", "9", "Рабочий", "Геймдизайнеры"},
    // художники
    {10, "ivanova", "Иванова О.Ю.", "10", "Рабочий", "Художники"},
    {11, "petrova", "Петрова Н.П.", "11", "Рабочий", "Художники"},
    {12, "popova", "Попова А.Н.", "12", "Рабочий", "Художники"},
    {13, "sazonova", "Сазонова Д.И.", "13", "Рабочий", "Художники"},
    // программисты
    {14, "bobrova", "Боброва Н.П.", "14", "Рабочий", "Программисты"},
    {15, "popov", "Попов П.И.", "15", "Рабочий", "Программисты"},
    {16, "potapov", "Потапов А.Е.", "16", "Рабочий", "Программисты"},
    {17, "sazonov", "Сазонов Н.Н.", "17", "Рабочий", "Программисты"},
    // тестистировщики
    {18, "linev", "Линев А.А.", "18", "Рабочий", "Тестировщики"},
    {19, "manin", "Манин В.В.", "19", "Рабочий", "Тестировщики"},
    {20, "potapova", "Потапова С.Ю.", "20", "Рабочий", "Тестировщики"},
    {21, "selivanov", "Селиванов Н.Н.", "21", "Рабочий", "Тестировщики"}
};
